build/resources/createInputBean.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.engine.ck.com/">
   <soapenv:Header>
        <Usuario xmlns="uri:com.ck.engine.ws" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">$username</Usuario>
        <Password xmlns="uri:com.ck.engine.ws" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">$password</Password>
   </soapenv:Header>
   <soapenv:Body>
      <ws:requestInputBean>
            <input>
                <tipoOdc>Firme</tipoOdc>
                <cuenta>$accountId</cuenta>

                <idOdc>$id</idOdc>
                <fechaEntrega>$fecha</fechaEntrega>
                <totalRegistros>$total</totalRegistros>
                <cantidadTotalSkus>$cantidadTotal</cantidadTotalSkus>

                <idAlmacen>1256</idAlmacen>
                <idProveedor>1</idProveedor>
$listProducto
            </input>
      </ws:requestInputBean>
   </soapenv:Body>
</soapenv:Envelope>
